{
    "Andhra Pradesh": "Andhra Pradesh is a state in the southeastern coastal region of India. It is known for its rich cultural heritage, historical significance, and beautiful landscapes.",
    "Arunachal Pradesh": "Arunachal Pradesh is a state in northeastern India known for its breathtaking natural beauty, diverse indigenous cultures, and vibrant festivals.",
    "Assam": "Assam is a state in northeastern India famous for its lush tea gardens, rich biodiversity, and unique Assamese culture.",
    "Bihar": "Bihar is a state in eastern India with a rich historical and cultural heritage. It is known for its ancient sites, religious significance, and festivals.",
    "Chhattisgarh": "Chhattisgarh is a state in central India known for its dense forests, vibrant tribal culture, and ancient temples.",
    "Goa": "Goa is a state on the southwestern coast of India renowned for its stunning beaches, Portuguese colonial architecture, and lively nightlife.",
    "Gujarat": "Gujarat is a state in western India known for its rich history, vibrant culture, and architectural marvels such as the Rani Ki Vav and the Sun Temple.",
    "Haryana": "Haryana is a state in northern India known for its agricultural prosperity, vibrant folk culture, and historical significance.",
    "Himachal Pradesh": "Himachal Pradesh is a state in the northern part of India famous for its scenic beauty, snow-capped mountains, and adventure sports.",
    "Jharkhand": "Jharkhand is a state in eastern India known for its rich mineral resources, diverse tribal culture, and picturesque landscapes.",
    "Karnataka": "Karnataka is a state in southwest India known for its rich heritage, diverse wildlife, and the magnificent ruins of Hampi and the temple town of Mysore.",
    "Kerala": "Kerala is a state in southern India known for its scenic backwaters, palm-fringed beaches, lush greenery, and vibrant culture.",
    "Madhya Pradesh": "Madhya Pradesh is a state in central India known for its rich history, stunning architecture, and abundant wildlife in national parks like Kanha and Bandhavgarh.",
    "Maharashtra": "Maharashtra is a state in western India known for its vibrant culture, historical landmarks such as the Gateway of India, and bustling cities like Mumbai and Pune.",
    "Manipur": "Manipur is a state in northeastern India known for its natural beauty, rich culture, and the traditional Manipuri dance form.",
    "Meghalaya": "Meghalaya is a state in northeastern India known for its picturesque landscapes, cascading waterfalls, and vibrant tribal culture.",
    "Mizoram": "Mizoram is a state in northeastern India known for its stunning landscapes, vibrant festivals, and rich cultural heritage.",
    "Nagaland": "Nagaland is a state in northeastern India known for its lush greenery, colorful tribal culture, and the vibrant Hornbill Festival.",
    "Odisha": "Odisha is a state in eastern India known for its rich history, ancient temples such as the Sun Temple in Konark, and vibrant art and culture.",
    "Punjab": "Punjab is a state in northern India known for its fertile land, rich cultural heritage, and the Sikh community's religious significance.",
    "Rajasthan": "Rajasthan is a state in northern India known for its vibrant culture, majestic forts and palaces, and the Thar Desert.",
    "Sikkim": "Sikkim is a state in northeastern India known for its stunning landscapes, Buddhist monasteries, and vibrant cultural festivals.",
    "Tamil Nadu": "Tamil Nadu is a state in southern India known for its rich history, ancient temples, classical dance forms, and vibrant festivals.",
    "Telangana": "Telangana is a state in southern India known for its rich history, architectural marvels, and the bustling city of Hyderabad.",
    "Tripura": "Tripura is a state in northeastern India known for its picturesque landscapes, diverse tribal cultures, and vibrant festivals.",
    "Uttarakhand": "Uttarakhand is a state in northern India known for its scenic beauty, pilgrimage sites, and adventure tourism.",
    "Uttar Pradesh": "Uttar Pradesh is a state in northern India known for its historical significance, ancient monuments, and vibrant culture.",
    "West Bengal": "West Bengal is a state in eastern India known for its rich cultural heritage, literature, arts, and festivals such as Durga Puja.",
    "Andaman and Nicobar Islands": "Andaman and Nicobar Islands are a group of islands in the Bay of Bengal known for their stunning beaches, marine biodiversity, and historic cellular jail.",
    "Chandigarh": "Chandigarh is a union territory and the capital of both Punjab and Haryana known for its modernist architecture, gardens, and vibrant urban culture.",
    "Dadra and Nagar Haveli and Daman & Diu": "Dadra and Nagar Haveli and Daman & Diu are union territories known for their scenic beauty, Portuguese colonial architecture, and rich cultural heritage.",
    "The Government of NCT of Delhi": "The Government of NCT of Delhi, often referred to as Delhi, is a union territory and the capital city of India known for its historic landmarks, vibrant markets, and diverse culture.",
    "Jammu & Kashmir": "Jammu & Kashmir is a union territory known for its breathtaking landscapes, rich cultural heritage, and religious significance.",
    "Ladakh": "Ladakh is a union territory known for its stunning landscapes, Buddhist monasteries, and vibrant culture.",
    "Lakshadweep": "Lakshadweep is a union territory known for its pristine beaches, coral reefs, and rich marine biodiversity.",
    "Puducherry": "Puducherry is a union territory known for its charming French architecture, serene beaches, and vibrant culture."
}
